Revit 2027 API
ParameterTypeId.StructuralAttachmentStartRefelementEnd Property
 "Start of Attachment to Reference Element"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentStartRefelementEnd { get; }
Public Shared ReadOnly Property StructuralAttachmentStartRefelementEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentStartRefelementEnd {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentStartRefelementEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace